# Oh My Zsh libraries (core behavior + completions)
ohmyzsh/ohmyzsh path:lib

# Oh My Zsh plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/archlinux
ohmyzsh/ohmyzsh path:plugins/extract

# Completions
zsh-users/zsh-completions

# fzf-tab — must come AFTER compinit, BEFORE autosuggestions/highlighting
Aloxaf/fzf-tab

# Third-party
zsh-users/zsh-autosuggestions

# Syntax highlighting MUST be last
zsh-users/zsh-syntax-highlighting
